## #01. 단일행 데이터 조회

In [ ]:
# SQLAlchemy
    # DBMS = 데이터 웨어하우스 (in SQLD)
    # DBMS 종류에 구애 안받고 데이터 처리 가능
    # -> 한번 코딩으로 모든종류 DBMS 연동가능
    # Pandas(분석용 라이브러리)랑 같이 사용

In [ ]:
# if hell0 = {"a":123, "b":234}
#   => **hello -> "a"=123, "b"=234로 변경하는 기능
#       딕셔너리의 모든 원소를 'key=value, key=value,..' 형식으로 나열

# conn의 기능: MariaDB[myschool]> 기능을 다 수행함
#   -> 앞으로 이 기능 계속 끌어다 쓸거임

# conn.execute의 기능: 
# python "따옴표 안의 명령어" -> MariaDB로 전송 
#   -> ""가 벗겨지면서 안의 명령어 실행됨 

# .mappings().all()의 기능
#   : 딕셔너리가 포함된 리스트 결과 출력

# ':변수'는 형식문자임

### 데이터베이스 접속하기(1)

In [ ]:
# 필요한 라이브러리 참조

from sqlalchemy import create_engine, text
# create_engine(): DBMS랑 연결 생성 -> SQLAlchemy가 DB에 접근할 수 있는 객체 생성
# text(): 순수 SQL문을 안전하게 작성, 실행할 수 있도록 SQLAlchemy 문법으로 감싸는 함수.
#         변수를 SQL문의 형식문자에 치환할 수 있게 함

from pandas import DataFrame
# DataFrame: rows와 colums로 구성된 2차원 데이터 구조
#            다양한 형태의 데이터를 표 형식으로 저장, 조작, 분석할 수 있는 객체 생성

### 데이터베이스 접속하기(2)

In [ ]:
# 접속 문자열 생성
    # 데이터베이스 접속 정보 조합해서 
    # SQLAlchemy가 요구하는 형식문자열 생성
        # mariadb+pymysql://계정이름:비밀번호@서버주소:포트/데이터베이스?charset=utf8mb4

config = {
    'username': 'root',
    'password': '1234',
    'hostname': 'localhost',
    'port': 9090,
    'database': 'myschool',
    'charset': 'utf8mb4'        # 한글깨짐방지
}

con_str_tpl = "mariadb+pymysql://{username}:{password}@{hostname}:{port}/{database}?charset={charset}"

con_str = con_str_tpl.format(**config)  # 딕셔너리를 'key=value, key=value,..' 형식으로 나열해서 파라미터 일괄 설정
print(con_str)

### 데이터베이스 접속하기(3)

In [ ]:
# 데이터베이스에 접속하여 SQL 실행 객체 생성

try:
    engine = create_engine(con_str)
    conn = engine.connect()
    # .connect(): 데이터베이스에 접속해서 SQL실행객체를 리턴받는 매서드
    print("Database connect success~!~!")
except Exception as e:
    print("Database connect fail!!!", e)

### 단일행 데이터 조회하기

In [ ]:
# 단 하나의 행만 조회하는 SQL문 실행하기

# sql문 정의
sql = text("SELECT id, name, grade, department_id FROM students WHERE id=10101")

try:
    # SQL문을 실행 및 결과 객체 받기 
    result = conn.execute(sql)
except Exception as e:
    print("[SQL Error]", e)
    # 코드의 진행을 중단시킴
    raise SystenExit

#sql문 실행 결과를 딕셔너리 포함한 리스트 형태로 변환
resultset = result.mappings().all()
print(resultset)

### WHERE절에 사용할 조건값을 변수로 만들기

In [ ]:
# 형식문자를 포함한 SQL 실행

# 검색할 조건값 입력받기
student_id = input("검색할 학번을 입력하세요.")

# SQL문 정의 -> 변수로 치환할 부분을 ':변수명' 형식으로 처리함
# #         -> 치환될 문자는 문자열이더라도 홑따옴표 사용 안함
sql = text("SELECT id, name, grade, department_id FROM students WHERE id = :student_id")

# SQL문의 물음표에 치환할 값을 딕셔너리로 묶음 (물음표 순서에 따라 조합)
params = {"student_id" : student_id}

try:
    # SQL문을 실행 및 결과 객체 받기 -> 치환할 값에 대한 딕셔너리도 함께 전달
    result = conn.execute(sql, params)
except Exception as e:
    print("[SQL Error]", e)
    raise SystemExit

# 단일행 조회에 대한 결과 집합 출력
resultset = result.mappings().all()
print(resultset)

## #02. 다중행 데이터 조회

##### 데이터프레임화: 이쁘게 표로 정리하는 것

In [ ]:
# 형식문자 (:이름) 없음
# => try 구문 conn.execute() 괄호 안에 sql만 들어가있음

# by conn.execute(sql): 딕셔너리를 원소로 가지는 리스트가 출력
# -> 반복문 돌려서 데이터 이쁘게 출력가능!
# => dictionary 하나당 row가 됨

# 우리가 분석할 '모든 데이터'는 '데이터프레임'화 되어야 한다!
# -> reason why we use jupiter as a coding source rather than .py
# jupiter는 표 이쁘게, 이미지 바로 아래에 출력해줌

# python(db, Flask, crowlling) -> data수집 -> python(data frame화) -> 정제, 전처리 -> EDA
    # EDA(Exploratory Data Analysis, 탐색적 데이터 분석)
    # - traditional method: 기초통계: 가설검증, 분산분석, 상관분석, 회귀분석(선형, 다항, 로지스틱) -> 잔차검정
    # - nowadays: 머신러닝

### 여러 행(=표)을 반환하는 SQL문 실행해보기

In [ ]:
# SQL문 정의

sql = text("SELECT id, dname, loc, phone, email FROM departments LIMIT 0, 5")
# 형식문자 (:이름) 없음

# => 따라서 아래의 try 구문의 conn.execute() 괄호 안에 sql만 들어가있음
try:
    result = conn.execute(sql)
except Exception as e:
    print("[SQL Error]", e)
    raise SystemExit

#단일행 조회에 대한 결과 집합 출력하기
resultset = result.mappings().all()
print(resultset)

### 결과 집합 사용하기(1)

In [ ]:
# by 위의 conn.execute(sql): '딕셔너리를 원소로 가지는' 리스트가 출력
# -> 반복문 돌려서 데이터 이쁘게 출력가능!
# => dictionary 하나당 row가 됨

In [ ]:
# 반복문을 활용한 데이터 출력

#리스트 길이 = 조회된 결과 집합의 수
print("총 %d건의 데이터가 조회됨" % len(resultset))

#출력을 위한 문자열 템플릿 생성
tmpl = "학과번호: {id}, 학과이름: {dname}, 위치: {loc}, 연락처: {phone}, 이메일: {email}"

#반복문으로 문자열 포메팅 수행하면서 개별 행 하나씩 출력 ㄱ
for row in resultset:
    print(tmpl.format(**row)) # **: 딕셔너리의 모든 원소를 나열

### 결과 집합 사용하기(2)

In [ ]:
# DataFrame: pandas 라이브러리에 포함된 클래스
    # "딕셔너리를 원소로 가지는 리스트"를 
    # 생성자 파라미터로 전달받고, 표로 변환해서 리턴해줌!
    # 표로 이쁘게 정리해줌!
        # 이러한 표는 '데이터 프레임 객체'라고 부름

In [ ]:
# 결과 집합을 표 형태로 변환

df1 = DataFrame(resultset)

#python 출력문으로 출력하는 방법
print(df1)

### 결과 집합 사용하기(3)

In [ ]:
# jupiter 고유 기능 활용해서 표 형태로 출력하는 방법
df1

### 입력값에 따른 검색 결과 만들기

In [ ]:
#검색어 만들기:
key = input("검색할 교수 이름을 입력하세요.")
# 입력: 김

#SQL문 정의: 치환될 문자는 홑따옴표 사용안함! 
# (여기서는 keyword임, 홑따옴표 말고 :씀)
sql = text("""SELECT
           p.id AS 교수번호, name AS 이름, position AS 직급,sal AS 급여,
           comm AS 보직수당, hiredate AS 입사일, dname AS 소속학과
           FROM professors p
           INNER JOIN departments d ON 
            p.department_id = d.id
           WHERE name like concat('%', :keyword, '%')""")
# 마지막 줄에서 만약 concat으로 감싸고 %들만 ''로 감싸지 않고, '%:keyword%'를 쓴다면
    # 출력은 '김현주', '김정훈' 처럼 나오게됨!
    # 출력에 '' 포함 안되게 하기 위해서 concat 쓰는거임

#SQL문 실생하기:
try:
    result = conn.execute(sql, {"keyword": key})
    # "keyword"가 line12의 :keyword 이고
    # colon 뒤의 key는 line2의 key임
except Exception as e:
    print("[SQL Error]", e)
    raise SystenExit

#조회결과를 jupiter 기능 이용한 이쁜 표로 출력:
resultset = result.mappings().all()
df = DataFrame(resultset)
df

# 03. 데이터 입력/수정/삭제

### isert/update/delete
### create는 다른걸로 할거임

In [ ]:
# 데이터 입력할 때,
# MD5(): 암호화 처리 해주는 함수
# SQLAlchemy는 insert/update/delete할 때 자동으로 트랜젝션 건다
# 생성된 PK값 추출하는건 only do when 데이터 입력(insert)

# 데이터 수정할 때,
# 수정된 데이터수 출력시 0이 출력되는 case:
# 입력한 pk인 id 값이 db에 존재 안할 때 (where절 조건이 안맞는 경우)
# 수정한 같은 내용을 또 수정할 때 (before, atfer 결과가 동일한 경우)

### Insert. 데이터 입력하기(1)

In [ ]:
# SQLAlchemy 접속객체: conn
# read_sql: Pandas가 dataframe으로 쓰는 객체

In [ ]:
#데이터를 저장하기 위한 SQL문 템플릿 작성
sql = text("""
        INSERT INTO students (
            name, user_id, grade, idnum, birthdate, phone, height,
            weight, email, gender, status, admission_date, department_id
        ) VALUES (
            :name, :user_id, :grade, MD5(:idnum), :birthdate, :phone, :height,
            :weight, :email, :gender, :status, :admission_date, :department_id
        )
    """)

#SQL문에 치환할 실제 값
new_student = {
    "name": '나신입', "user_id": 'newbie', "grade": 1, "idnum": '9205171000000', 
    "birthdate": '2024-03-15', "phone": '010-9876-5432', "height": 175, 
    "weight": 82, "email": 'newbie@myschool.ac.kr', "gender": '남', 
    "status": '재학', "admission_date": '2028-02-12', "department_id": 101
}

In [ ]:
try:
    result = conn.execute(sql, new_student) # SQL문 실행 w/ 자동 트랜젝션
    affected_rows = result.rowcount         # 저장된 행의 수
    conn.commit()                           # 변경사항을 데이터베이스에 영구저장

    #생성된 PK값 추출하기
    pk_result = conn.execute(text("SELECT LAST_INSERT_ID()"))
    pk = pk_result.scalar()
except Exception as e:
    print("SQL Error:", e)
    conn.rollback()
    raise SystemExit

# INSERT문의 결과로 생성된 Primary Key값 확인법:
print("저장된 행의 수:", affected_rows, ", 신규 학생 ID:", pk)

### 데이터 수정하기

In [ ]:
#특정 학생의 연락처, 이메일 수정하기
sql = text("UPDATE students SET phone=:phone, email=:email WHERE id=:id")

#수정할 데이터 준비
params = {"phone": "010-1234-5678", "email": "jinwoo.h@myschool.ac.kr", "id": 10102}

#SQL문 실행
try:
    result = conn.execute(sql, params)
    conn.commit()
except Exception as e:
    print(f"데이터 수정 오류: {e}")
    conn.rollback()
    raise SystemExit

print("수정된 데이터 수:", result.rowcount)

### 데이터 삭제하기

In [ ]:
#특정 학생 수강내역 삭제하기
sql = text("DELETE FROM enrollments WHERE student_id=:id")

#수정할 데이터 준비
params = {"id": 10102}

#SQL문 실행
try:
    result = conn.execute(sql, params)
    conn.commit()
except Exception as e:
    print(f"데이터 삭제 오류, {e}")
    conn.rollback()
    raise SystemExit

print("삭제된 데이터 수:", result.rowcount)

## 04. Pandas 활용 데이터 조회

In [ ]:
### 기본 데이터 조회

In [ ]:
#필요한 모듈 참조하기
from pandas import read_sql

#SQL문의 결과를 표 형태로 직접 가져오기
sql = text("SELECT id, name, position, sal, comm FROM professors WHERE sal > 500")

try:
    #SQL문과 SQLAlchemy의 접속객체를 파라미터로 전달해서 바로 데이터프레임 생성
    df = read_sql(sql, conn)
except Exception as e:
    print("SQL Error:", e)
    raise SystemExit

df

In [ ]:
### 검색 조건을 입력받아서 직접 가져오기

In [ ]:
min_height = int(input("키의 하한값을 입력하세요."))
max_height = int(input("키의 상한값을 입력하세요."))

sql = text("""
           SELECT id, name, grade, height, weight, gender
           FROM students
           WHERE height BETWEEN :min AND :max""")

try:
    df = read_sql(sql, conn, params={"min": min_height, "max": max_height})
except Exception as e:
    print("SQL error:", e)
    raise SystenExit

df

### 검색결과를 파일로 저장하기(1)

In [ ]:
# CSV 파일로 저장하기
    # 저장될 파일의 인코딩을 지정해야 한다 -> 여기서는 "utf-8"
df.to_csv("학생목록.csv", encoding="utf-8")

# CSV파일 확인하기 -> VScode에서

### 검색결과를 파일로 저장하기(2)

In [ ]:
# 엑셀파일로 저장하기
df.to_excel("학생목록.xlsx")

## 연구과제: covid19 테이블을 myschool db에 생성

In [1]:
import pandas as pd
from pandas import DataFrame

df = pd.read_csv("covid19.csv", encoding="euc-kr")
df

              날짜  서울시 일일 확진  서울시 일일 사망  전국 일일 확진  전국 일일 사망
0     2023-05-31     5987.0          6   24411.0        17
1     2023-05-30     3326.0          1   13529.0         7
2     2023-05-29     1393.0          1    6868.0         3
3     2023-05-28     1393.0          1    6868.0         3
4     2023-05-27     4078.0          0   17796.0         3
...          ...        ...        ...       ...       ...
1207  2020-02-09        0.0          0       0.0         0
1208  2020-02-08        0.0          0       0.0         0
1209  2020-02-07        0.0          0       0.0         0
1210  2020-02-06        0.0          0       0.0         0
1211  2020-02-05        0.0          0       0.0         0

[1212 rows x 5 columns]

In [2]:
from sqlalchemy import create_engine, text

config = {
    'username': 'root',
    'password': '1234',
    'hostname': 'localhost',
    'port': 9090,
    'database': 'myschool',
    'charset': 'utf8mb4'        # 한글깨짐방지
}

con_str_tpl = "mariadb+pymysql://{username}:{password}@{hostname}:{port}/{database}?charset={charset}"

con_str = con_str_tpl.format(**config)  # 딕셔너리를 'key=value, key=value,..' 형식으로 나열해서 파라미터 일괄 설정
print(con_str)


try:
    engine = create_engine(con_str)
    conn = engine.connect()
    # .connect(): 데이터베이스에 접속해서 SQL실행객체를 리턴받는 매서드
    print("Database connect success~!~!")
except Exception as e:
    print("Database connect fail!!!", e)

mariadb+pymysql://root:1234@localhost:9090/myschool?charset=utf8mb4
Database connect success~!~!

In [3]:
#데이터를 저장하기 위한 SQL문 템플릿 작성
sql = text("""
        CREATE TABLE IF NOT EXISTS covid19 (
           id DATE PRIMARY KEY COMMENT '날짜',
           seoul_confirm_day INT DEFAULT 0 COMMENT '서울시 일일 확진자 수',
           seoul_death_day INT DEFAULT 0 COMMENT '서울시 일일 사망자 수',
           nation_confirm_day INT DEFAULT 0 COMMENT '전국 일일 확진자 수',
           nation_death_day INT DEFAULT 0 COMMENT '전국 일일 사망자 수'
        ) DEFAULT CHARSET=utf8 COLLATE=utf8_bin COMMENT='COVID 19';
    """)

try:
    conn.execute(sql)
    print("테이블 COVID_19이 성공적으로 생성 되었습니다.")
except Exception as e:
    print("[SQL Error:], e")
    raise SystemExit

테이블 COVID_19이 성공적으로 생성 되었습니다.

In [6]:
from pandas import read_sql

sql = text("""
           SELECT 
            DATE_FORMAT(id, '%Y-%m') as 월별, 
            SUM(seoul_confirm_day) as 서울시_월별_확진자_합계,
            SUM(seoul_death_day) as 서울시_월별_사망자_합계,
            SUM(nation_confirm_day) as 전국_월별_확진자_합계,
            SUM(nation_death_day) as 전국_월별_사망자_합계
           FROM covid19 GROUP BY 월별
           UNION
           SELECT 
            DATE_FORMAT(id, '%Y') as 년도별, 
            SUM(seoul_confirm_day) as 서울시_년도별_확진자_합계,
            SUM(seoul_death_day) as 서울시_년도별_사망자_합계,
            SUM(nation_confirm_day) as 전국_년도별_확진자_합계,
            SUM(nation_death_day) as 전국_년도별_사망자_합계
           FROM covid19 GROUP BY 년도별
           """)

try:
    df = read_sql(sql, conn)
except Exception as e:
    print("[SQL Error]", e)
    raise SystemExit

df

Empty DataFrame
Columns: [월별, 서울시_월별_확진자_합계, 서울시_월별_사망자_합계, 전국_월별_확진자_합계, 전국_월별_사망자_합계]
Index: []

In [17]:
df.to_excel(covid19.xlsx)

NameError: name 'covid19' is not defined